<a href="https://colab.research.google.com/github/ikfaisal/dsia/blob/master/DSIA_Lab_2_1_3_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

![alt text](https://bit.ly/2Ooh01X)

# Lab 2.1.3: 
# *Database Programming with Python and SQLite*

<a name="demo"></a>
## Using SQLite

### Advantages of SQLite

- does not run on a separate server
- creates portable SQL databases saved in a single file
- databases are stored in a very efficient manner and allow fast querying
- ideal for small databases or databases that need to be copied across machines.
- prototyping applications (e.g. as an embedded database server in a Python program).

### The `sqlite3` Command Line Utility

- useful for basic SQL tasks and databse maintenance
- for creating and dropping databases, it may be safer to use the command line than to roll the code into a Python program

1. Add the sqlite3 installation folder to your PATH environment variable.
2. Open a command window.
3. Navigate to your preferred working directory.
4. Start the sqlite3 command line utility and create a database called "ex1":

`$ sqlite3 ex1`

Output:  

`SQLite version 3.8.5 2014-05-29 12:36:14
Enter ".help" for usage hints.
sqlite>`

*Nb. If you leave out the database name (after `sqlite3`, above) a new, temporary database will be created; it will be destroyed upon exiting sqlite3.*

Enter the following commands at the sqlite prompt (not shown):

`create table tbl1(one varchar(10), two smallint);
insert into tbl1 values('hello!',10);
insert into tbl1 values('goodbye', 20);
select * from tbl1;`

Output:  

`hello!|10
goodbye|20`

Enter `.help` at the sqlite3 command prompt. This lists the available "dot commands". 

Some of the more useful dot commands include:

`  
.backup ?DB? FILE      Backup DB (default "main") to FILE.
.cd DIRECTORY          Change the working directory to DIRECTORY
.clone NEWDB           Clone data into NEWDB from the existing database
.databases             List names and files of attached databases
.dump ?TABLE? ...      Dump the database in an SQL text format.
.excel                 Display the output of next command in a spreadsheet
.exit                  Exit this program
.headers on|off        Turn display of headers on or off
.help                  Show this message
.import FILE TABLE     Import data from FILE into TABLE
.indexes ?TABLE?       Show names of all indexes.
.quit                  Exit this program
.read FILENAME         Execute SQL in FILENAME
.restore ?DB? FILE     Restore content of DB (default "main") from FILE
.save FILE             Write in-memory database into FILE
.tables ?TABLE?        List names of tables.`

### The `sqlite3` package

The easiest way to incorporate an SQL database into a Python application is by using the `sqlite3` package for [`Python 2.7`](https://docs.python.org/2.7/library/sqlite3.html) or [`Python 3.x`](https://docs.python.org/3/library/sqlite3.html).

Open a connection to an SQLite database file.  As before, if the file does not already exist it will automatically be created.

In [7]:
%pwd

'C:\\Users\\sepid\\Desktop\\UTS course\\work\\DSIA-SYD-FT-201907\\DSIA-SYD-FT-201907\\Module 2\\LABS 2'

In [15]:
import sqlite3
sqlite_db = 'sql1.db'
conn = sqlite3.connect(sqlite_db) 
c = conn.cursor()

In [14]:
pwd

'C:\\Users\\sepid\\Desktop\\UTS course\\work\\lab2-my work to copy then\\LABS 2'

Commands can be executed by passing them as string arguments to the `execute` method of the cursor we just created for this database.

*Nb. If this script has never been run before, the following will raise an (inconsequential) error message:*

In [18]:
c.execute('DROP TABLE tbl1;')

#results = c.execute("SELECT * from tbl1;")
#results.fetchall()
# Save (commit) the changes:
conn.commit()

In [17]:
c.execute('CREATE TABLE houses (field1 INTEGER PRIMARY KEY, sqft INTEGER, bdrms INTEGER, age INTEGER, price INTEGER);')
conn.commit()

With the database saved the table should now be viewable using SQLite Manager.

#### Adding data

Since we're back in python, we can now use regular programming techniques in conjunction with the sqlite connection.  In particular, the cursor's `execute()` method supports value substitutionusing the `?` character, which makes adding multiple records a bit easier.  See the [docs](https://docs.python.org/2.7/library/sqlite3.html) for more details.

> c.execute(sql_command, values)

In [19]:
# A
last_sale = (None, 4000, 5, 22, 619000)

# Execute Command
c.execute('INSERT INTO houses VALUES (?,?,?,?,?)',last_sale)

# Remember to commit the changes
conn.commit()

Notice that in this syntax we use the python `None` value, rather than `NULL`, to trigger SQLite to auto-increment the Primary Key. 

There is a related cursor method `executemany()` which takes an array of tuples and loops through them, substituting one tuple at a time.

> c.executemany(sql_command, values)

In [20]:
# A
recent_sales = [
  (None, 2390, 4, 34, 319000),
  (None, 1870, 3, 14, 289000),
  (None, 1505, 3, 90, 269000),
]

c.executemany('INSERT INTO houses VALUES (?,?,?,?,?)',recent_sales)

# Nb. The "?" parameters are placeholders for data that will map to the table columns during insertion;
# this is a security measure against SQL injection attacks:
# 

conn.commit()

Select all rows from houses

In [28]:
# A
res1 = c.execute('select * from houses')
res1.fetchall()

[(1, 4000, 5, 22, 619000),
 (2, 2390, 4, 34, 319000),
 (3, 1870, 3, 14, 289000),
 (4, 1505, 3, 90, 269000)]

# Adding data from a csv file
One way to populate the database from a file is to use `numpy.genfromtxt` to read the file into an array (converted to a list for easier handling), and then `INSERT` those records into the database.  The `genfromtxt` function has options including the output data type, handling of missing values, skipping of header and footer rows, columns to read, and more.

In [40]:
from numpy import genfromtxt

# import into nparray of ints, then convert to list of lists:
data = genfromtxt('housing-data.csv', dtype = 'i8', 
                    delimiter = ',', skip_header = 1).tolist()

Suppose we need to put a placeholder in the first column for data that will be available later. Best practice is to insert the value `None`:

In [41]:
# prepend a None value to beginning of each sub-list:
for d in data:
    d.insert(0, None)

*Nb. This is why we converted the input array to a list. An array can only hold one type of data (integers in this case) so we could not have inserted `None` before we did this conversion.*

In [42]:
# check:
print(type(data))
print(data[0:3])

<class 'list'>
[[None, 2104, 3, 70, 399900], [None, 1600, 3, 28, 329900], [None, 2400, 3, 44, 369000]]

Now we can insert each list item as a row of fields in the database.

In [43]:
# loop through data, running an INSERT on each record (i.e. sublist):
for d in data:
    c.execute('INSERT INTO houses VALUES (?, ?, ?, ?, ?)', d)

conn.commit()

In this case, because we were inserting the same value for all records, so we could have simply used a 'None' in the numpy `insert` method at column 0.

In [44]:
import numpy as np
d1 = np.asarray([1200, 3, 15, 250000])
d1 = d1.tolist()
d1.insert(0, None)
d1
c.execute('INSERT INTO houses VALUES (?, ?, ?, ?, ?)', d1)
conn.commit()

#### Deleting Rows

The `DELETE FROM` statement can be used with a `WHERE` clause to specify rows to delete based on some criteria.

In [45]:
c.execute('DELETE FROM houses WHERE field1 IN (52, 53)')
conn.commit()

QUIZ: What would `DELETE FROM houses` do?

#### Filtering Rows

**1. Select Rows Where Bedrooms = 4**

In [47]:
res2=c.execute('select * from houses where bdrms=4;')
res2.fetchall()

[(2, 2390, 4, 34, 319000),
 (9, 3000, 4, 75, 539900),
 (10, 1985, 4, 61, 299900),
 (15, 1940, 4, 7, 239999),
 (20, 2300, 4, 77, 449900),
 (23, 2609, 4, 5, 499998),
 (24, 3031, 4, 21, 599000),
 (28, 1962, 4, 53, 259900),
 (37, 2040, 4, 75, 314900),
 (39, 1811, 4, 24, 285900),
 (42, 2132, 4, 28, 345000),
 (43, 4215, 4, 66, 549000),
 (44, 2162, 4, 43, 287000),
 (47, 2567, 4, 57, 314000),
 (50, 1852, 4, 64, 299900)]

**2. Run a query to calculate the average floor area and price of each size of house (i.e. by number of bedrooms):**

In [48]:
# ANSWER
results = c.execute("SELECT bdrms, AVG(sqft) AS avg_sqft, AVG(price) AS avg_price FROM houses GROUP BY bdrms")
results.fetchall()

[(1, 1000.0, 169900.0),
 (2, 1496.5, 280866.6666666667),
 (3, 1827.5555555555557, 322892.51851851854),
 (4, 2399.733333333333, 373553.13333333336),
 (5, 4239.0, 659450.0)]

### Pandas connector

While databases provide many analytical capabilities, at some point we may need to pull data into Python for more flexible processing. Large, fixed operations would be more efficient in a database, but Pandas allows for interactive processing.

For example, if you want to aggregate nightly log-ins or sales for a report or dashboard, this would be a fixed operation on a large dataset. These computations would run more efficiently in the database system itself.

However, if we wanted to model the patterns of login behaviour or factors driving sales, then we would import the data to Python where we could use its simple interfaces to powerful analytic libraries.

In [50]:
import pandas as pd
from pandas.io import sql

Pandas can connect to most relational databases. In this demonstration, we will create and connect to a SQLite database.

### Writing data into a database

Data in Pandas can be loaded into a relational database. 

If the data table is not too large, we can load all of it into a Pandas DataFrame:

In [51]:
# Nb. Use low_memory=False to ensure that type inference does not fail due to buffered processing of input:
data = pd.read_csv('housing-data.csv', low_memory = False)
data.head()

   sqft  bdrms  age   price
0  2104      3   70  399900
1  1600      3   28  329900
2  2400      3   44  369000
3  1416      2   49  232000
4  3000      4   75  539900

We can move data in the opposite direction -- from a DataFrame to a database -- using the `to_sql` command, similar to the `to_csv` command.

`to_sql` takes as arguments:
    - `name`, the table name to create
    - `con`, a connection to a database
    - `index`, whether to input the index column
    - `schema`, if we want to write a custom schema for the new table
    - `if_exists`, what to do if the table already exists. We can overwrite it, add to it, or fail

This copies our `data` DataFrame to a sqlite3 table called `houses_pandas`:

In [52]:
data.to_sql('houses_pandas', con = conn, if_exists = 'replace', index = False)

Run a query to get the average price of each house size from this table:

In [57]:
c.execute('select bdrms,avg(price) from houses group by bdrms;').fetchall()
    #avg.fetchall()

[(1, 169900.0),
 (2, 280866.6666666667),
 (3, 322892.51851851854),
 (4, 373553.13333333336),
 (5, 659450.0)]

## Discussion

**Scenarios for using Pandas with SQLite**

1. When would you want to use Pandas on a dataset before storing it in a database?

2. When would you want to use Pandas on a dataset retrieved from a database?

<a name="guided-practice"></a>


# Reference: SQL Syntax 


#### SELECT Statement
Every query should start with `SELECT`.  `SELECT` is followed by the names of the columns in the output.

`SELECT` is always paired with `FROM`, and `FROM` identifies the table to retrieve data from.

```sql
SELECT
<columns>
FROM
<table>
```

`SELECT *` denotes returns *all* of the columns.

Housing Data example:
```sql
SELECT
sqft, bdrms
FROM houses_pandas;
```

**Check:** Write a query that returns the `sqft`, `bdrms` and `price`.

```sql
SELECT
sqft, bdrms, price
FROM houses_pandas;
```

#### WHERE Clause
`WHERE` is used to filter table to a specific criteria and follows the `FROM` clause.

```sql
SELECT
<columns>
FROM
<table>
WHERE
<condition>
```
Example:
```sql
SELECT
sqft, bdrms, age, price
FROM houses_pandas
WHERE bdrms = 2 and price < 250000;
```

The condition is effectively a row filter; rows that match the condition will be included in the rowset that is returned by the query.

**Check:** Write a query that returns the `sqft`, `bdrms`, `age` for houses older than 60 years.
>```sql
SELECT
sqft, bdrms, age
FROM houses_pandas
WHERE age > 60;
```

### AGGREGATIONS

Aggregations (or aggregate functions) are functions where the values of multiple rows are grouped together as input on certain criteria to form a single value of more significant meaning or measurement such as a set, a bag or a list.

Examples of aggregate funtions:

- Average (i.e., arithmetic mean)
- Count
- Maximum
- Minimum
- Median
- Mode
- Sum

In SQL they are performed in a `SELECT` statement as follows.

```sql
SELECT COUNT(price)
FROM houses_pandas;
```

```sql
SELECT AVG(sqft), MIN(price), MAX(price)
FROM houses_pandas
WHERE bdrms = 2;
```

### Read Order Data
- P12-ListOfOrders
- P12-OrderBreakdown

#### 1. Read CSV into DataFrame

In [22]:
import pandas as pd
import sqlite3
from pandas.io import sql

In [63]:
# Reading CSV to Dataframe
orders = pd.read_csv('P12-ListOfOrders.csv', encoding = 'utf-8')
orders_break_down =  pd.read_csv('P12-OrderBreakdown.csv', encoding = 'utf-8')

In [24]:
orders.head()

          Order ID  Order Date      Customer Name         Country
0  IT-2011-3647632  2011-01-01       Eugene Moren          Sweden
1  ES-2011-4869686  2011-01-03  Dorothy Dickinson  United Kingdom
2  ES-2011-4939443  2011-01-04     Arthur Prichep          France
3  IT-2011-2942451  2011-01-04     Grant Thornton  United Kingdom
4  ES-2011-3848439  2011-01-05   Michael Granlund          France

In [25]:
orders_break_down.head()

,Order ID,Product Name,Discount,Sales,Quantity,Category
0,IT-2011-3647632,"Enermax Note Cards, Premium",0.5,45.0,3,Office Supplies
1,ES-2011-4869686,"Dania Corner Shelving, Traditional",0.0,854.0,7,Furniture
2,ES-2011-4939443,"Binney & Smith Sketch Pad, Easy-Erase",0.0,140.0,3,Office Supplies
3,IT-2011-2942451,"Boston Markers, Easy-Erase",0.5,27.0,2,Office Supplies
4,IT-2011-2942451,"Eldon Folders, Single Width",0.5,17.0,2,Office Supplies

#### 2. Replace Space with Underscore in Column Names

In [73]:
# ANSWER
orders.columns = [o.replace(' ', '_') for o in orders.columns.str.lower()]

In [65]:
orders.columns

Index(['order_id', 'order_date', 'customer_name', 'country'], dtype='object')

In [74]:
# ANSWER
orders_break_down.columns = [o.replace(' ', '_') for o in orders_break_down.columns.str.lower()]

#### 3. Check DataTypes

In [29]:
# ANSWER
orders.dtypes

Order ID         object
Order Date       object
Customer Name    object
Country          object
dtype: object

In [75]:
# ANSWER
orders_break_down.dtypes

order_id         object
product_name     object
discount        float64
sales           float64
quantity          int64
category         object
dtype: object

#### 4. Save these two dataframes as a table in sqlite

In [79]:
# Establishing Local DB connection
db_connection = sqlite3.connect('eshop.db.sqlite')
orders.to_sql('orders', con = db_connection, if_exists = 'replace', index = False)
orders_break_down.to_sql('orders_break_down', con = db_connection, if_exists = 'replace', index = False)
c1=db_connection.cursor()
# Save these two dataframes as a table in sqlite

#### 5. Select Number of Orders for Each Customer

In [97]:
# Select Number of Orders for Each Customer
#res3=c1.execute('SELECT customer_name,COUNT(DISTINCT orders.order_id) AS Count FROM orders JOIN orders_break_down ON orders_break_down.order_id = orders.order_id GROUP BY customer_name ORDER BY Count DESC;')
#res3.fetchall()
res3='''SELECT 
        customer_name, 
        COUNT(DISTINCT orders.order_id) AS Count 
    FROM orders 
    JOIN orders_break_down ON orders_break_down.order_id = orders.order_id
    GROUP BY customer_name ORDER BY Count DESC
'''
customers = sql.read_sql(res3, con = db_connection)
print(type(customers))

customers.head()

<class 'pandas.core.frame.DataFrame'>

    customer_name  Count
0      John Grady     13
1  Aaron Smayling     12
2    Joel Jenkins     12
3   Aaron Bergman     11
4  Anthony Rawles     11

#### 6. Select Number of Customers for Each Country

In [104]:
# Select Number of Customers for Each Country
#res4=c1.execute('select country,count( distinct customer_name) as count_name FROM orders GROUP BY country ORDER BY Count DESC from orders;')
#print(type(res4))

res4 = '''select country,count( distinct customer_name) as count_name from orders GROUP BY country ORDER BY count_name DESC'''
country = sql.read_sql(res4, con = db_connection)
country.head()

          country  count_name
0          France         568
1         Germany         505
2  United Kingdom         473
3           Italy         351
4           Spain         306

#### 7.A Select discount, sales, quantity for Each Order from orders_break_down Table

In [107]:
#  Select discount, sales, quantity for Each Order from orders_break_down Table
res5='''Select discount, sales, quantity from orders_break_down '''
my_selection = sql.read_sql(res5,con = db_connection)
my_selection.head()

   discount  sales  quantity
0       0.5   45.0         3
1       0.0  854.0         7
2       0.0  140.0         3
3       0.5   27.0         2
4       0.5   17.0         2

#### 7.B Select discount, sales, quantity, total price for Each Order from orders_break_down Table

> Total Price = sales * quantity - discount

In [110]:
# Select discount, sales, quantity, total price for Each Order from orders_break_down Table
res6 = ''' Select discount, sales, quantity, sales * quantity - discount as total_price from orders_break_down ORDER BY total_price DESC'''
t_price = sql.read_sql(res6,con=db_connection)
t_price.head()

   discount   sales  quantity  total_price
0       0.1  5729.0        14      80205.9
1       0.0  6517.0        12      78204.0
2       0.1  4748.0        14      66471.9
3       0.1  5726.0        10      57259.9
4       0.0  4141.0        13      53833.0

#### 7.C Select All Orders from orders_break_down Table Where Total Price Greater Than 100

In [116]:
# Select All Orders from orders_break_down Table Where Total Price Greater Than 100
res7 = '''SELECT 
        *
        , (sales * quantity - discount) AS total_price
    FROM orders_break_down 
    WHERE sales * quantity - discount > 100
    ORDER BY total_price ASC

'''

customers = sql.read_sql(res7, con = db_connection)
customers.head()

,order_id,product_name,discount,sales,quantity,category,total_price
0,IT-2011-2668777,"Binney & Smith Canvas, Blue",0.5,51.0,2,Office Supplies,101.5
1,IT-2011-1165265,"Cardinal Binding Machine, Durable",0.5,51.0,2,Office Supplies,101.5
2,ES-2012-1763830,"Elite Scissors, High Speed",0.5,34.0,3,Office Supplies,101.5
3,IT-2012-4099397,"Sanford Canvas, Blue",0.5,51.0,2,Office Supplies,101.5
4,ES-2013-4250046,"Cardinal Binding Machine, Durable",0.5,51.0,2,Office Supplies,101.5

#### 8. Select All Customer And The Product They Have Bought

In [132]:
# Select All Customer And The Product They Have Bought
res8='''SELECT orders.order_id, orders.customer_name,orders_break_down.product_name 
FROM orders JOIN orders_break_down ON orders.order_id = orders_break_down.order_id order by customer_name ''' 

customers = sql.read_sql(res8, con = db_connection)
customers

,order_id,customer_name,product_name
0,ES-2011-3528133,Aaron Bergman,"Apple Office Telephone, Cordless"
1,ES-2011-3528133,Aaron Bergman,"Elite Box Cutter, High Speed"
2,ES-2011-3528133,Aaron Bergman,"Harbour Creations Round Labels, Laser Printer ..."
3,ES-2011-4146320,Aaron Bergman,"Binney & Smith Markers, Fluorescent"
4,ES-2011-4146320,Aaron Bergman,"Novimex Shipping Labels, Alphabetical"
5,ES-2011-4184901,Aaron Bergman,"Elite Letter Opener, High Speed"
6,ES-2011-4184901,Aaron Bergman,"Tenex Light Bulb, Duo Pack"
7,ES-2012-4291867,Aaron Bergman,"Office Star Bag Chairs, Black"
8,ES-2012-4291867,Aaron Bergman,"Okidata Calculator, Durable"
9,ES-2012-4291867,Aaron Bergman,"Stockwell Clamps, Bulk Pack"
10,ES-2012-4291867,Aaron Bergman,"Tenex File Cart, Blue"
11,ES-2012-2621001,Aaron Bergman,"Konica Receipt Printer, Durable"
12,IT-2012-2898980,Aaron Bergman,"Cisco Office Telephone, Cordless"
13,IT-2012-2898980,Aaron Bergman,"Ibico Binder Covers, Clear"
14,ES-2013-1413393,Aaron Bergman,"Belkin Keyboard, Ergonomic"
15,ES-2013-1752483,Aaron Bergman,"Epson Calculator, Red"
16,ES-2013-1752483,Aaron Bergman,"HP Personal Copier, Digital"
17,IT-2014-1559800,Aaron Bergman,"Fellowes Shelving, Industrial"
18,IT-2014-3675672,Aaron Bergman,"Smead Legal Exhibit Labels, Adjustable"
19,IT-2014-3675672,Aaron Bergman,"Tenex Shelving, Blue"
20,ES-2014-3856656,Aaron Bergman,"Brother Fax and Copier, Color"
21,ES-2014-3856656,Aaron Bergman,"Novimex Shipping Labels, Alphabetical"
22,IT-2011-4320455,Aaron Hawkins,"Epson Inkjet, Wireless"
23,IT-2011-4320455,Aaron Hawkins,"Xerox Note Cards, Recycled"
24,IT-2011-1626202,Aaron Hawkins,"Stockwell Push Pins, 12 Pack"
25,ES-2013-3394564,Aaron Hawkins,"BIC Markers, Easy-Erase"
26,ES-2014-5295631,Aaron Hawkins,"Bush Library with Doors, Mobile"
27,ES-2014-1569434,Aaron Hawkins,"Smead Legal Exhibit Labels, Alphabetical"
28,ES-2014-1511007,Aaron Hawkins,"Logitech Mouse, Bluetooth"
29,ES-2014-1511007,Aaron Hawkins,"SanDisk Numeric Keypad, Bluetooth"
...,...,...,...
8017,IT-2011-3183678,Zuschuss Carroll,"Breville Microwave, Silver"
8018,IT-2011-3183678,Zuschuss Carroll,"Cameo Clasp Envelope, Security-Tint"
8019,IT-2011-3183678,Zuschuss Carroll,"Cuisinart Stove, Silver"
8020,IT-2011-3183678,Zuschuss Carroll,"Xerox Computer Printout Paper, Premium"
8021,ES-2012-4934724,Zuschuss Carroll,"Office Star Executive Leather Armchair, Adjust..."
8022,ES-2013-1901640,Zuschuss Carroll,"Stiletto Letter Opener, Easy Grip"
8023,ES-2013-1218192,Zuschuss Carroll,"BIC Canvas, Blue"
8024,ES-2013-1218192,Zuschuss Carroll,"Canon Fax Machine, High-Speed"
8025,ES-2013-1218192,Zuschuss Carroll,"Logitech Flash Drive, Bluetooth"
8026,ES-2013-1218192,Zuschuss Carroll,"Samsung Smart Phone, Cordless"
8027,ES-2013-1218192,Zuschuss Carroll,"Tenex Folders, Wire Frame"
8028,IT-2014-2109178,Zuschuss Carroll,"Advantus Staples, Assorted Sizes"
8029,IT-2014-3511710,Zuschuss Carroll,"BIC Pens, Fluorescent"
8030,IT-2014-3511710,Zuschuss Carroll,"Binney & Smith Pens, Easy-Erase"
8031,IT-2014-3511710,Zuschuss Carroll,"Tenex Door Stop, Durable"
8032,IT-2014-5630655,Zuschuss Carroll,"Eaton Memo Slips, Premium"
8033,ES-2014-4168626,Zuschuss Carroll,"Ibico 3-Hole Punch, Durable"
8034,ES-2014-5366847,Zuschuss Carroll,"Ames Manila Envelope, Security-Tint"
8035,ES-2014-5366847,Zuschuss Carroll,"Xerox Note Cards, Premium"
8036,ES-2011-4052630,Zuschuss Donatelli,"Barricks Round Table, with Bottom Storage"
8037,ES-2011-4052630,Zuschuss Donatelli,"Binney & Smith Canvas, Water Color"
8038,ES-2011-4052630,Zuschuss Donatelli,"Okidata Calculator, Red"
8039,ES-2011-4052630,Zuschuss Donatelli,"Smead Trays, Blue"
8040,ES-2011-2379967,Zuschuss Donatelli,"Avery Removable Labels, Adjustable"
8041,ES-2011-2379967,Zuschuss Donatelli,"Konica Calculator, Red"
8042,IT-2012-2197138,Zuschuss Donatelli,"Hewlett Fax Machine, Laser"
8043,IT-2012-4926272,Zuschuss Donatelli,"Office Star Executive Leather Armchair, Adjust..."
8044,ES-2012-4610139,Zuschuss Donatelli,"Accos Rubber Bands, Metal"
8045,IT-2012-3146139,Zuschuss Donatelli,"Memorex Numeric Keypad, Bluetooth"
8046,IT-2012-3146139,Zuschuss Donatelli,"SanDisk Parchment Paper, Premium"

#### 9.A Select Number of 'Furniture' Orders For Each Country

In [137]:
# Select Number of 'Furniture' Orders For Each Country
res9='''
    SELECT 
        orders.country
        , COUNT(orders_break_down.category) AS Count           
    FROM orders
    JOIN orders_break_down
    ON orders.order_id = orders_break_down.order_id
    WHERE orders_break_down.category = 'Furniture'
    GROUP BY orders.country'''

order_list = sql.read_sql(res9, con = db_connection)

order_list

           country  Count
0          Austria     40
1          Belgium     20
2          Denmark      9
3          Finland     16
4           France    299
5          Germany    264
6          Ireland     12
7            Italy    136
8      Netherlands     76
9           Norway      6
10        Portugal     10
11           Spain    123
12          Sweden     36
13     Switzerland     11
14  United Kingdom    180

#### 9.B Select Number of 'Furniture' Orders For The Country Denmark

In [138]:
# Select Number of 'Furniture' Orders For The Country Denmark
res10='''SELECT 
        *       
    FROM orders
    JOIN orders_break_down
    ON orders.order_id = orders_break_down.order_id
    WHERE orders_break_down.category = 'Furniture'
        AND orders.country = 'Denmark'
'''

order_list = sql.read_sql(res10, con = db_connection)

order_list.head()

,order_id,order_date,customer_name,country,order_id,product_name,discount,sales,quantity,category
0,ES-2011-1586186,2011-06-16,Vivek Grady,Denmark,ES-2011-1586186,"Office Star Bag Chairs, Set of Two",0.5,87.0,3,Furniture
1,IT-2012-4084224,2012-02-15,Mick Brown,Denmark,IT-2012-4084224,"Rubbermaid Door Stop, Ergonomic",0.6,17.0,1,Furniture
2,IT-2013-4649004,2013-05-31,Bart Folk,Denmark,IT-2013-4649004,"Novimex Executive Leather Armchair, Red",0.5,920.0,4,Furniture
3,ES-2013-3422294,2013-09-07,Dave Brooks,Denmark,ES-2013-3422294,"Advantus Door Stop, Duo Pack",0.6,36.0,2,Furniture
4,ES-2014-3653593,2014-02-10,Ivan Liston,Denmark,ES-2014-3653593,"Deflect-O Clock, Black",0.6,161.0,8,Furniture

#### 10. Select Total Sales With Discount and Without Discount for Each Country

In [143]:
# Select Total Sales With Discount and Without Discount for Each Country
res11='''SELECT
        orders.country
        , SUM(CASE WHEN discount == 0 THEN sales ELSE 0 END) AS discount_sales
        , SUM(CASE WHEN discount > 0 THEN sales ELSE 0 END) AS non_discount_sales       
    FROM orders
    JOIN orders_break_down ON orders.order_id = orders_break_down.order_id
    GROUP BY orders.country'''

total_sale = sql.read_sql(res11, con = db_connection)

total_sale.head()

   country  discount_sales  non_discount_sales
0  Austria         79382.0                 0.0
1  Belgium         42320.0                 0.0
2  Denmark             0.0              7763.0
3  Finland         20702.0                 0.0
4   France        129791.0            479892.0

#### 11.A Select Total Quantity, Total Sales for Each Country

In [144]:
# Select Total Quantity, Total Sales for Each Country
res12='''SELECT
        orders.country
        , SUM(sales) AS total_sales
        , SUM(quantity) AS total_quantity       
    FROM orders
    JOIN orders_break_down ON orders.order_id = orders_break_down.order_id
    GROUP BY orders.country
'''

order_list = sql.read_sql(res12, con = db_connection)

order_list.head()

   country  total_sales  total_quantity
0  Austria      79382.0             973
1  Belgium      42320.0             532
2  Denmark       7763.0             204
3  Finland      20702.0             201
4   France     609683.0            7329

#### 11.B Select Top 3 Country Based on Sales

In [148]:
# Select Top 3 Country Based on Sales
res13= '''SELECT
        orders.country
        , SUM(sales) AS total_sales
        , SUM(quantity) AS total_quantity       
    FROM orders_break_down
    JOIN orders ON orders.order_id = orders_break_down.order_id
    GROUP BY orders.country
    ORDER BY total_sales DESC 
'''

order_list = sql.read_sql(res13, con = db_connection)

order_list.head()

          country  total_sales  total_quantity
0          France     609683.0            7329
1         Germany     488681.0            6179
2  United Kingdom     420497.0            4917
3           Italy     252742.0            3612
4           Spain     249402.0            2881

In [150]:
res13= '''SELECT
        orders.country
        , SUM(sales) AS total_sales
        , SUM(quantity) AS total_quantity       
    FROM orders
    JOIN orders_break_down ON orders.order_id = orders_break_down.order_id
    GROUP BY orders.country
    ORDER BY total_sales DESC limit 3
'''

order_list = sql.read_sql(res13, con = db_connection)

order_list.head()

          country  total_sales  total_quantity
0          France     609683.0            7329
1         Germany     488681.0            6179
2  United Kingdom     420497.0            4917

In [151]:
order_list.sort_values(by='total_sales', ascending=False).head(3)

          country  total_sales  total_quantity
0          France     609683.0            7329
1         Germany     488681.0            6179
2  United Kingdom     420497.0            4917

#### 11.C Select Bottom 3 Country Based On Quantities

In [152]:
# Select Bottom 3 Country Based On Quantities
res14= '''
    SELECT
        orders.country
        , SUM(sales) AS total_sales
        , SUM(quantity) AS total_quantity       
    FROM orders
    JOIN orders_break_down ON orders.order_id = orders_break_down.order_id
    GROUP BY orders.country
    ORDER BY total_quantity ASC LIMIT 3
'''

order_list = sql.read_sql(res14, con = db_connection)

order_list.head()

   country  total_sales  total_quantity
0  Finland      20702.0             201
1  Denmark       7763.0             204
2   Norway      20529.0             261

In [153]:
order_list.sort_values(by='total_quantity', ascending=True).head(3)

   country  total_sales  total_quantity
0  Finland      20702.0             201
1  Denmark       7763.0             204
2   Norway      20529.0             261

#### 12. Select Average Sales By Categroy For The Country 'France'

In [172]:
# Select Average Sales By Categroy For The Country 'France'
res15='''SELECT
        orders.country
        , orders_break_down.category
        , AVG(sales) AS avg_sales       
    FROM orders
    JOIN orders_break_down ON orders.order_id = orders_break_down.order_id
    WHERE orders.country = 'France'
    GROUP BY orders.country, orders_break_down.category
    ORDER BY avg_sales DESC
'''

order_list = sql.read_sql(res15, con = db_connection)

order_list

  country         category   avg_sales
0  France       Technology  595.145078
1  France        Furniture  582.314381
2  France  Office Supplies  167.217709

In [171]:
res16='''SELECT
        orders.country
        , orders_break_down.category
        , AVG(sales) AS avg_sales       
    FROM orders
    JOIN orders_break_down ON orders.order_id = orders_break_down.order_id
    GROUP BY orders.country,orders_break_down.category
    
'''

order_list = sql.read_sql(res16, con = db_connection)

order_list

           country         category   avg_sales
0          Austria        Furniture  527.275000
1          Austria  Office Supplies  176.299435
2          Austria       Technology  576.297872
3          Belgium        Furniture  443.500000
4          Belgium  Office Supplies  206.864583
5          Belgium       Technology  715.315789
6          Denmark        Furniture  163.444444
7          Denmark  Office Supplies   94.461538
8          Denmark       Technology  217.333333
9          Finland        Furniture  600.125000
10         Finland  Office Supplies  160.526316
11         Finland       Technology  500.000000
12          France        Furniture  582.314381
13          France  Office Supplies  167.217709
14          France       Technology  595.145078
15         Germany        Furniture  506.215909
16         Germany  Office Supplies  150.008451
17         Germany       Technology  627.913183
18         Ireland        Furniture  238.833333
19         Ireland  Office Supplies   91.402985
20         Ireland       Technology  333.714286
21           Italy        Furniture  476.227941
22           Italy  Office Supplies  150.222561
23           Italy       Technology  478.229947
24     Netherlands        Furniture  372.263158
25     Netherlands  Office Supplies   77.152893
26     Netherlands       Technology  311.333333
27          Norway        Furniture  704.000000
28          Norway  Office Supplies  128.021739
29          Norway       Technology  578.666667
30        Portugal        Furniture  296.200000
31        Portugal  Office Supplies  153.489362
32        Portugal       Technology  379.230769
33           Spain        Furniture  507.512195
34           Spain  Office Supplies  195.912525
35           Spain       Technology  655.066667
36          Sweden        Furniture  305.055556
37          Sweden  Office Supplies   93.263158
38          Sweden       Technology  208.941176
39     Switzerland        Furniture  537.090909
40     Switzerland  Office Supplies  133.870370
41     Switzerland       Technology  902.846154
42  United Kingdom        Furniture  597.761111
43  United Kingdom  Office Supplies  159.848655
44  United Kingdom       Technology  703.780992

#### 13. Select Country, Category and Total Sales Where Average Total Sales is The Highest

In [175]:
# Select Country, Category and Total Sales Where Average Total Sales is The Highest
res17='''
    SELECT
        orders.country
        , orders_break_down.category
        , AVG(sales) AS total_sales       
    FROM orders
    JOIN orders_break_down ON orders.order_id = orders_break_down.order_id
    GROUP BY orders.country, orders_break_down.category
    ORDER BY total_sales DESC LIMIT 1
'''

order_list = sql.read_sql(res17, con = db_connection)

order_list.head()

       country    category  total_sales
0  Switzerland  Technology   902.846154

### JOINS

Below is a link to a handy reference for SQL joins. In this chart joins are represented in terms of sets and venn diagrams. 
https://www.codeproject.com/Articles/33052/Visual-Representation-of-SQL-Joins

Alternatively, remember the merge functionality of pandas.
https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf

In [182]:
%pwd

'C:\\Users\\sepid\\Desktop\\UTS course\\work\\lab2-my work to copy then\\LABS 2'

### ADDITIONAL RESOURCES

- [sqlite3 home](http://www.sqlite.org)  
- [sqlite3 Python documentation](https://docs.python.org/3/library/sqlite3.html)
- [SQLite Python tutorial](http://sebastianraschka.com/Articles/2014_sqlite_in_python_tutorial.html)  
- [SQL zoo](http://www.sqlzoo.net)  Great for learning syntax





> 
> 
>
>
>
>
>

> 


> 



>

** 2019 Data Science Institute of Australia**